#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=912008965710]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.records.data.aws_route53_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "dev.fabririvas.com"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + private_zone               = false
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.records.aws_route53_record.this["dev A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev.dev.fabririvas.com"
      + records         = [
          + "10.0.0.1",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.zones.aws_route53_zone.this["dev.fabririvas.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Domain for dev.fabririvas.com"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.fabririvas.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "ManagedBy" = "Terraform"
          + "partition" = "public"
        }
      + tags_all            = {
          + "ManagedBy" = "Terraform"
          + "partition" = "public"
        }
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + info = {
      + account_id = "912008965710"
      + arn        = "arn:aws:sts::912008965710:assumed-role/oidc-github-actions/1721696981556193427"
      + id         = "912008965710"
      + user_id    = "AROA5IV7YNZHB2VIY6LLJ:1721696981556193427"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform-dev.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform-dev.plan"

```

</details>

*Pusher: @fabrinator, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*